# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4

   [-1, 1, EGhost_1, [128, nn.LeakyReLU(0.1)]],  # 2
   [-1, 1, EGhost_2, [128, nn.LeakyReLU(0.1)]],  # 3

   [ -1, 1, MP, [ ] ],  # 4-P3/8

   [ -1, 1, EGhost_1, [ 256, nn.LeakyReLU(0.1) ] ],  # 5
   [ -1, 1, EGhost_2, [ 256, nn.LeakyReLU(0.1) ] ],  # 6

   [ -1, 1, MP, [ ] ],  # 7-P4/8

   [ -1, 1, EGhost_1, [ 512, nn.LeakyReLU(0.1) ] ],  # 8
   [ -1, 1, EGhost_2, [ 512, nn.LeakyReLU(0.1) ] ],  # 9

   [ -1, 1, MP, [ ] ],  # 10-P5/8
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [ -1, 1, EGhost_1, [ 512, nn.LeakyReLU(0.1) ] ],  # 12
   [ -1, 1, EGhost_2, [ 512, nn.LeakyReLU(0.1) ] ],  # 13
  ]

# yolov7-tiny head
head:
  [[-1, 1, GhostSPPF, [256, nn.LeakyReLU(0.1)]],  # 14

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [9, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 24

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [ -1, 1, Conv, [ 32, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -2, 1, Conv, [ 32, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 32, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 32, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 34

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 24], 1, Concat, [1]],

   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 42

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 14], 1, Concat, [1]],

   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -2, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 128, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 128, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 256, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 50

   [34, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [42, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [50, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[51,52,53], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
